index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-10 Sun 15:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ZSH initialization file</title>
<meta name="author" content="Kristian Alexander P" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">ZSH initialization file</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbb06841">1. Initialization files</a>
<ul>
<li><a href="#orgf6cb9b1">1.1. .zshrc</a></li>
<li><a href="#org1287392">1.2. .zshenv</a></li>
<li><a href="#org96e3995">1.3. .zlogin</a></li>
<li><a href="#org0cd7827">1.4. .zlogout</a></li>
<li><a href="#orgfbfcb98">1.5. .config/zsh/zshenv.d</a>
<ul>
<li><a href="#org0ce2120">1.5.1. 00-base.zsh</a></li>
<li><a href="#orge6cdde3">1.5.2. 00-editors.zsh</a></li>
<li><a href="#org6ff4f87">1.5.3. 00-security.zsh</a></li>
<li><a href="#org723179d">1.5.4. 10-local-bin.zsh</a></li>
<li><a href="#orgfd85577">1.5.5. 10-term.zsh</a></li>
<li><a href="#org18b2b72">1.5.6. 10-cabal.zsh</a></li>
<li><a href="#org1bcfc71">1.5.7. 10-cargo.zsh</a></li>
<li><a href="#orgb15f5b2">1.5.8. 10-composer.zsh</a></li>
<li><a href="#orgd197d68">1.5.9. 10-fsharp.zsh</a></li>
<li><a href="#orga452776">1.5.10. 10-go.zsh</a></li>
<li><a href="#orge36b049">1.5.11. 10-npm.zsh</a></li>
<li><a href="#orgef86a89">1.5.12. 10-python.zsh</a></li>
<li><a href="#org4a7e8f5">1.5.13. 10-ruby.zsh</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb06841" class="outline-2">
<h2 id="orgbb06841"><span class="section-number-2">1.</span> Initialization files</h2>
<div class="outline-text-2" id="text-1">
</div>
