index.html
<div id="outline-container-orgf6cb9b1" class="outline-3">
<h3 id="orgf6cb9b1"><span class="section-number-3">1.1.</span> .zshrc</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">.zshrc
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">for use with oh-my-zsh https://ohmyz.sh/
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">alexforsale <a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
</span><span style="color: #00008b;">export</span> <span style="color: #b8860b;">ZSH</span>=<span style="color: #bc8f8f;">"$HOME/.oh-my-zsh"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">auto install oh-my-zsh
</span><span style="color: #4169e1;">if</span> [ ! -d <span style="color: #bc8f8f;">"$ZSH"</span> ]; <span style="color: #4169e1;">then</span>
    sh -c <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">curl -fsSL https://raw.githubusercontent.com/ohmyzsh/ohmyzsh/master/tools/install.sh</span><span style="color: #bc8f8f;">)"</span> <span style="color: #bc8f8f;">""</span> --unattended
<span style="color: #4169e1;">fi</span>

<span style="color: #b8860b;">ZSH_THEME</span>=<span style="color: #bc8f8f;">"robbyrussell"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">ZSH_THEME_RANDOM_CANDIDATES=( "robbyrussell" "agnoster" )
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to use case-sensitive completion.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">CASE_SENSITIVE="true"
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to use hyphen-insensitive completion.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">Case-sensitive completion must be off. _ and - will be interchangeable.
</span><span style="color: #b8860b;">HYPHEN_INSENSITIVE</span>=<span style="color: #bc8f8f;">"true"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment one of the following lines to change the auto-update behavior
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">zstyle ':omz:update' mode disabled  # disable automatic updates
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">zstyle ':omz:update' mode auto      # update automatically without asking
</span>zstyle <span style="color: #bc8f8f;">':omz:update'</span> mode reminder  <span style="color: #b22222;"># </span><span style="color: #b22222;">just remind me to update when it's time
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to change how often to auto-update (in days).
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">zstyle ':omz:update' frequency 13
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line if pasting URLs and other text is messed up.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">DISABLE_MAGIC_FUNCTIONS="true"
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to disable colors in ls.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">DISABLE_LS_COLORS="true"
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to disable auto-setting terminal title.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">DISABLE_AUTO_TITLE="true"
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to enable command auto-correction.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">ENABLE_CORRECTION="true"
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to display red dots whilst waiting for completion.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">You can also set it to another string to have that shown instead of the default red dots.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">e.g. COMPLETION_WAITING_DOTS="%F{yellow}waiting...%f"
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">Caution: this setting can cause issues with multiline prompts in zsh &lt; 5.7.1 (see #5765)
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">COMPLETION_WAITING_DOTS="true"
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line if you want to disable marking untracked files
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">under VCS as dirty. This makes repository status check for large repositories
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">much, much faster.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">DISABLE_UNTRACKED_FILES_DIRTY="true"
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line if you want to change the command execution time
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">stamp shown in the history command output.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">You can set one of the optional three formats:
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">"mm/dd/yyyy"|"dd.mm.yyyy"|"yyyy-mm-dd"
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">or set a custom format using the strftime function format specifications,
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">see 'man strftime' for details.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">HIST_STAMPS="mm/dd/yyyy"
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Would you like to use another custom folder than $ZSH/custom?
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">ZSH_CUSTOM=/path/to/new-custom-folder
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Which plugins would you like to load?
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">Standard plugins can be found in $ZSH/plugins/
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">Custom plugins may be added to $ZSH_CUSTOM/plugins/
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">Example format: plugins=(rails git textmate ruby lighthouse)
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">Add wisely, as too many plugins slow down shell startup.
</span><span style="color: #b8860b;">plugins</span>=(git pass zoxide fzf)

<span style="color: #00008b;">source</span> $<span style="color: #b8860b;">ZSH</span>/oh-my-zsh.sh

<span style="color: #b22222;"># </span><span style="color: #b22222;">User configuration
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Preferred editor for local and remote sessions
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">if [[ -n $SSH_CONNECTION ]]; then
</span><span style="color: #b22222;">#   </span><span style="color: #b22222;">export EDITOR='vim'
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">else
</span><span style="color: #b22222;">#   </span><span style="color: #b22222;">export EDITOR='nvim'
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">fi
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Compilation flags
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">export ARCHFLAGS="-arch $(</span><span style="font-weight: bold;">uname -m</span><span style="color: #b22222;">)"
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Set personal aliases, overriding those provided by Oh My Zsh libs,
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">plugins, and themes. Aliases can be placed here, though Oh My Zsh
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">users are encouraged to define aliases within a top-level file in
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">the $ZSH_CUSTOM folder, with .zsh extension. Examples:
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">- $ZSH_CUSTOM/aliases.zsh
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">- $ZSH_CUSTOM/macos.zsh
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">For a full list of active aliases, run `alias`.
</span><span style="color: #b22222;">#</span><span style="color: #b22222;">
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">Example aliases
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">alias zshconfig="mate ~/.zshrc"
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">alias ohmyzsh="mate ~/.oh-my-zsh"
</span><span style="color: #4169e1;">if</span> [[ -f /usr/share/doc/pkgfile/command-not-found.zsh ]]; <span style="color: #4169e1;">then</span>
        <span style="color: #00008b;">source</span> /usr/share/doc/pkgfile/command-not-found.zsh
<span style="color: #4169e1;">fi</span>

<span style="color: #4169e1;">if</span> [[ -f /usr/share/zsh/plugins/zsh-autosuggestions/zsh-autosuggestions.zsh ]]; <span style="color: #4169e1;">then</span>
        <span style="color: #00008b;">source</span> /usr/share/zsh/plugins/zsh-autosuggestions/zsh-autosuggestions.zsh
<span style="color: #4169e1;">fi</span>

<span style="color: #4169e1;">if</span> [[ -f /usr/share/zsh/plugins/zsh-syntax-highlighting/zsh-syntax-hightlighting.zsh ]]; <span style="color: #4169e1;">then</span>
        <span style="color: #00008b;">source</span> /usr/share/zsh/plugins/zsh-syntax-highlighting/zsh-syntax-hightlighting.zsh
<span style="color: #4169e1;">fi</span>

<span style="color: #4169e1;">if</span> [[ $(<span style="font-weight: bold;">command -v zoxide</span>) ]]; <span style="color: #4169e1;">then</span>
        <span style="color: #00008b;">eval</span> <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">zoxide init zsh --cmd cd</span><span style="color: #bc8f8f;">)"</span>
<span style="color: #4169e1;">fi</span>

<span style="color: #4169e1;">if</span> [[ $(<span style="font-weight: bold;">command -v nvim</span>) ]]; <span style="color: #4169e1;">then</span>
  <span style="color: #00008b;">alias</span> <span style="color: #b8860b;">vim</span>=<span style="color: #bc8f8f;">"nvim"</span>
  <span style="color: #00008b;">alias</span> <span style="color: #b8860b;">vi</span>=<span style="color: #bc8f8f;">"nvim"</span>
<span style="color: #4169e1;">fi</span>

autoload -U compinit
compinit -i
</pre>
</div>
</div>
</div>
