index.org
*** 10-npm.zsh
:PROPERTIES:
:header-args: :tangle .config/zsh/zshenv.d/10-npm.zsh :mkdirp t
:END:

#+begin_src shell
# .config/zsh/zshenv.d/10-npm.zsh
# see https://wiki.archlinux.org/index.php/Node.js
# alexforsale <alexforsale@yahoo.com>

if [ -d "${HOME}/.config/nvm" ]; then
    export NVM_DIR="${HOME}/.config/nvm"
elif [ "$(command -v npm)" ] && [ ! "$(command -v nvm)" ]; then
    export npm_config_prefix="$HOME/.local"
fi
#+end_src
*** 10-python.zsh
:PROPERTIES:
:header-args: :tangle .config/zsh/zshenv.d/10-python.zsh :mkdirp t
:END:

#+begin_src shell
# .config/zsh/zshenv.d/10-python.zsh
# alexforsale <alexforsale@yahoo.com>
if [ $(command -v pipenv) ]; then
    [ -z "${PIPENV_VENV_IN_PROJECT}" ] &&
        export PIPENV_VENV_IN_PROJECT=1
fi
#+end_src
*** 10-ruby.zsh
:PROPERTIES:
:header-args: :tangle .config/zsh/zshenv.d/10-ruby.zsh :mkdirp t
:END:

#+begin_src shell
# .config/zsh/zshenv.d/10-ruby.zsh
# alexforsale <alexforsale@yahoo.com>

if [ "$(command -v ruby)" ] &&
       [ -d "$(ruby -e 'print Gem.user_dir')/bin" ]; then
    path+=("$(ruby -e 'print Gem.user_dir')/bin")
    typeset -U path
fi
#+end_src
