index.html
<div id="outline-container-orge36b049" class="outline-4">
<h4 id="orge36b049"><span class="section-number-4">1.5.11.</span> 10-npm.zsh</h4>
<div class="outline-text-4" id="text-1-5-11">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">.config/zsh/zshenv.d/10-npm.zsh
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">see https://wiki.archlinux.org/index.php/Node.js
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">alexforsale <a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
</span>
<span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.config/nvm"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">NVM_DIR</span>=<span style="color: #bc8f8f;">"${HOME}/.config/nvm"</span>
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">command -v npm</span><span style="color: #bc8f8f;">)"</span> ] &amp;&amp; [ ! <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">command -v nvm</span><span style="color: #bc8f8f;">)"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">npm_config_prefix</span>=<span style="color: #bc8f8f;">"$HOME/.local"</span>
<span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgef86a89" class="outline-4">
<h4 id="orgef86a89"><span class="section-number-4">1.5.12.</span> 10-python.zsh</h4>
<div class="outline-text-4" id="text-1-5-12">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">.config/zsh/zshenv.d/10-python.zsh
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">alexforsale <a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
</span><span style="color: #4169e1;">if</span> [ $(<span style="font-weight: bold;">command -v pipenv</span>) ]; <span style="color: #4169e1;">then</span>
    [ -z <span style="color: #bc8f8f;">"${PIPENV_VENV_IN_PROJECT}"</span> ] &amp;&amp;
        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">PIPENV_VENV_IN_PROJECT</span>=1
<span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4a7e8f5" class="outline-4">
<h4 id="org4a7e8f5"><span class="section-number-4">1.5.13.</span> 10-ruby.zsh</h4>
<div class="outline-text-4" id="text-1-5-13">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">.config/zsh/zshenv.d/10-ruby.zsh
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">alexforsale <a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
</span>
<span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">command -v ruby</span><span style="color: #bc8f8f;">)"</span> ] &amp;&amp;
       [ -d <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">ruby -e 'print Gem.user_dir'</span><span style="color: #bc8f8f;">)/bin"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #b8860b;">path</span>+=(<span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">ruby -e 'print Gem.user_dir'</span><span style="color: #bc8f8f;">)/bin"</span>)
    <span style="color: #00008b;">typeset</span> -U path
<span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-05-10 Sun 00:00</p>
<p class="author">Author: Kristian Alexander P</p>
<p class="date">Created: 2026-05-10 Sun 15:52</p>
</div>
</body>
</html>
